<?php
return array(
	'admin_qq' => '272468213',
	'company_point' => 20,
	'article_category' => array(
		'1' => '网站公告',
		'2' => '装修常识',
		'3' => '装修术语',
		'4' => '乐装活动',
		'5' => '装修案例'
		),

	'type' => array(
		'1' => '设计',
		'2' => '清包',
		'3' => '半包',
		'4' => '全包'
		),
	'space' => array(
		'1' => '居家空间',
		'2' => '娱乐空间',
		'3' => '公共空间',
		'4' => '商铺'
		),
	'room' => array(
		'1' => '一室一厅一卫',
		'2' => '两室一厅一卫',
		'3' => '两室两厅一卫',
		'4' => '两室两厅两卫',
		'5' => '三室一厅一卫',
		'6' => '三室两厅一卫',
		'7' => '三室两厅两卫',
		'8' => '四室两厅两卫',
		'9' => '跃层住宅',
		'10' => '别墅花园',
		'11' => '其他'
		),
	);

?>