<html>
<head>
<meta HTTP-EQUIV="content-type" content="text/html;charset=gb2312">
<title></title>
<link rel="stylesheet" href="/phpbbs/main.css" type="text/css">
</head>
<body>
<h2>关于我自己:</h2>
<p>
<blockquote>
<pre>
没什么好说的,简单介绍一下自己吧!
姓名:朱明
性别:男
出生日期:1981-12-17
家庭背景:农村
单位:四川大学计科系2000级1班
E_mail:zerofault@163.com
寝室电话:028-85413550
英语能力:四级
特长:
有超强的动手能力、细致的观察力, 较强的逻辑思维能力；能迅速适应新事物；
熟悉计算机软硬件基础知识、以及各种操作系统、应用软件的安装运行和维护；熟悉电脑各种硬件配置及其性能；熟悉电脑一般软硬件故障，并能通过细心分析和研究解决问题；
掌握C，C++语言，掌握JAVA和数据库技术，熟悉HTML和PHP语言；
很强的自学能力；熟悉基于Windows平台下的Apache/IIS+PHP+MySQL网络服务器的安装与配置,并能熟练编写其平台上的动态网页程序；熟悉基于Windows平台下的Tomcat/Resin+JSP+SQL Server网络服务器的安装与配置，并能编写其平台上的动态网页程序；
兴趣爱好:听收音机,爱听流行音乐,能打几下乒乓球,对新产品特别是电子产品很感冒,喜欢修理一些小东西,并以此为乐.
自我评价:
没什么大本事,只有一颗真挚的心,有一些些热情,有点点好管闲事,有时爱故意刁难别人,有时还喜欢打击人,但都只是对熟人开的玩笑;
我是生活的有心人;
说话算话；

一句自夸的话:
自己可以过得不好,但是不能让周围的人过得不好!

以前有很多东西要学，吸引着你，所以可以早起，
现在都大四了，好多东西都已经学了，或者一些东西学烦了，工作又找到了，所以自然就睡懒觉了 
</pre>
</blockquote>
<?
echo urlencode('此间的少年');
echo '<br>';
echo urlencode('此间的少年-段誉');
echo '<br>';
echo urlencode('此间的少年-乔峰（II）');
?>
</body>
</html>